# -*- coding: utf-8 -*-
# FileName: plants_data.py
# Time : 2023/6/6 20:58
# Author: zzy
# 存储三种植物的数据

PLANTS_DESCRIPTION = {
    "葡萄黑腐病":
        """
        葡萄黑腐病（Grapevine black rot）是真菌病害，在东北、华北等地发生较多，一般为害不重，在长江以南地区，如遇连续高温高湿天气，则发病较重，如1991年遇到特大洪涝灾害后，不少园子均发生了程度不一的黑腐病。
        """
    ,
    "番茄叶斑病":
        """
        番茄灰叶斑病，只为害叶片，发病初期叶面布满暗色圆形或不正圆形小斑点，后沿叶脉向四周扩大，呈不规则形，中部渐褪为灰白至灰褐色。
        """
    ,
    "苹果黑星病":
        """
        苹果黑星病又称苹果疮痂病、黑点病，是由苹果黑星菌侵染所引起的、发生在苹果上的病害。主要危害叶片或果实，叶柄、果柄、花芽、花器及新梢，从落花期到苹果成熟期均可危害。
        """

}
