# -*- coding: utf-8 -*-
# FileName: grouping.py
# Time : 2023/6/12 10:39
# Author: zzy
import pprint
from itertools import groupby
from typing import Iterable

lst = [
    ('其他', 8, '0'), ('其他', 2, '1'),
    ('其他', 3, '2'), ('其他', 2, '3'),
    ('其他', 1, '4'), ('其他', 8, '5'),
    ('其他', 1, '6'),

    ('番茄叶斑病', 5, '0'), ('番茄叶斑病', 4, '1'),
    ('番茄叶斑病', 4, '2'), ('番茄叶斑病', 1, '3'),
    ('番茄叶斑病', 2, '4'), ('番茄叶斑病', 5, '5'),
    ('番茄叶斑病', 5, '6'),

    ('苹果黑星病', 4, '0'), ('苹果黑星病', 5, '1'),
    ('苹果黑星病', 2, '2'), ('苹果黑星病', 2, '3'),
    ('苹果黑星病', 9, '4'), ('苹果黑星病', 1, '5'),
    ('苹果黑星病', 3, '6'),

    ('葡萄黑腐病', 3, '0'), ('葡萄黑腐病', 5, '1'),
    ('葡萄黑腐病', 5, '2'), ('葡萄黑腐病', 1, '3'),
    ('葡萄黑腐病', 3, '5')
]

l2 = [['其他', 8, '0'],
      ['其他', 2, '1'],
      ['其他', 3, '2'],
      ['其他', 2, '3'],
      ['其他', 1, '4'],
      ['其他', 8, '5'],
      ['其他', 1, '6'],
      ['番茄叶斑病', 5, '0'],
      ['番茄叶斑病', 4, '1'],
      ['番茄叶斑病', 4, '2'],
      ['番茄叶斑病', 1, '3'],
      ['番茄叶斑病', 2, '4'],
      ['番茄叶斑病', 5, '5'],
      ['番茄叶斑病', 5, '6'],
      ['苹果黑星病', 4, '0'],
      ['苹果黑星病', 5, '1'],
      ['苹果黑星病', 2, '2'],
      ['苹果黑星病', 2, '3'],
      ['苹果黑星病', 9, '4'],
      ['苹果黑星病', 1, '5'],
      ['苹果黑星病', 3, '6'],
      ['葡萄黑腐病', 3, '0'],
      ['葡萄黑腐病', 5, '1'],
      ['葡萄黑腐病', 5, '2'],
      ['葡萄黑腐病', 1, '3'],
      ['葡萄黑腐病', 3, '5'],
      ['葡萄黑腐病', 6, '6']]


def grouping(iterable: Iterable, express=lambda tup: tup[0]):
    """
    利用表达式 分组
    :param iterable: 可迭代对象,
    :param express: lambda表达式
    :return: 分组后的数据
    """
    grp = groupby(iterable, express)
    for _, value in grp:
        yield list(value)


def complete_list(res):
    res = list(grouping(res))
    index = 6
    for grp in res:
        if grp[-1][-1] != '6':
            grp.insert(6, [grp[0][0], 0, '6'])
        for index, g in enumerate(grp):
            print(g)
            if g[2] == str(index):
                ...
            else:
                grp.insert(index, [g[0], g[1], str(index)])
    return res


if __name__ == '__main__':
    print(complete_list(lst))
